Revit 2027 API
ParameterTypeId.SheetCurrentRevision Property
 "Current Revision"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SheetCurrentRevision { get; }
Public Shared ReadOnly Property SheetCurrentRevision As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SheetCurrentRevision {
	ForgeTypeId^ get ();
}
static member SheetCurrentRevision : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace